app/controllers/posts_controller.rb

INSERT INTO `comments` (`by`, `created_at`, `title`, `body`, `updated_at`, `post_id`) VALUES(NULL, '2009-04-30 08:15:28', NULL, 'Hello', '2009-04-30 08:15:28', 1)
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def comment
      Post.find(params[:id]).comments.create(params[:comment])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 5)
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`, `create_date`) VALUES('2009-04-30 08:14:32', 'This is my amazing weblog!', 'Created by me', '2009-04-30 08:14:32', '2009-04-30 08:14:00')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 5)
UPDATE `posts` SET `updated_at` = '2009-04-30 10:35:32', `body` = 'This is a list of handy MySQL commands that I use time and time again. What is the aim?' WHERE `id` = 5
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
DELETE FROM `posts` WHERE `id` = 1
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy

SELECT * FROM `posts` WHERE (title LIKE '%shop%')
---
  def search
  @posts = Post.find(:all, :conditions => ["title LIKE ?", "%#{params[:key]}%"])